arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_adi_0_rf.h
// Field:   [3:0] IB
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_LNACTL2_IB_M                                       0x0000000F
#define ADI_0_RF_LNACTL2_IB_S                                                0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL0
//
//*****************************************************************************
// Field:   [7:3] TRIM
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL0_TRIM_M                                   0x000000F8
#define ADI_0_RF_IFAMPCTL0_TRIM_S                                            3

// Field:     [2] BIAS_DIS
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS                                 0x00000004
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS_BITN                                     2
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS_M                               0x00000004
#define ADI_0_RF_IFAMPCTL0_BIAS_DIS_S                                        2

// Field:     [1] EN_Q
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL0_EN_Q                                     0x00000002
#define ADI_0_RF_IFAMPCTL0_EN_Q_BITN                                         1
#define ADI_0_RF_IFAMPCTL0_EN_Q_M                                   0x00000002
#define ADI_0_RF_IFAMPCTL0_EN_Q_S                                            1
#define ADI_0_RF_IFAMPCTL0_EN_Q_EN                                  0x00000002
#define ADI_0_RF_IFAMPCTL0_EN_Q_DIS                                 0x00000000

// Field:     [0] EN_I
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL0_EN_I                                     0x00000001
#define ADI_0_RF_IFAMPCTL0_EN_I_BITN                                         0
#define ADI_0_RF_IFAMPCTL0_EN_I_M                                   0x00000001
#define ADI_0_RF_IFAMPCTL0_EN_I_S                                            0
#define ADI_0_RF_IFAMPCTL0_EN_I_EN                                  0x00000001
#define ADI_0_RF_IFAMPCTL0_EN_I_DIS                                 0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL1
//
//*****************************************************************************
// Field:   [5:0] GAIN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// MAX                      Internal. Only to be used through TI provided API.
// MAX_MINUS_3              Internal. Only to be used through TI provided API.
// MAX_MINUS_6              Internal. Only to be used through TI provided API.
// MAX_MINUS_9              Internal. Only to be used through TI provided API.
// MAX_MINUS_12             Internal. Only to be used through TI provided API.
// MAX_MINUS_15             Internal. Only to be used through TI provided API.
// MAX_MINUS_18             Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL1_GAIN_M                                   0x0000003F
#define ADI_0_RF_IFAMPCTL1_GAIN_S                                            0
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX                                 0x0000003F
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_3                         0x0000001F
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_6                         0x0000000F
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_9                         0x00000007
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_12                        0x00000003
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_15                        0x00000001
#define ADI_0_RF_IFAMPCTL1_GAIN_MAX_MINUS_18                        0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL2
//
//*****************************************************************************
// Field:   [2:0] ATTN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// MINUS_21                 Internal. Only to be used through TI provided API.
// MINUS_18                 Internal. Only to be used through TI provided API.
// MINUS_15                 Internal. Only to be used through TI provided API.
// MINUS_12                 Internal. Only to be used through TI provided API.
// MINUS_9                  Internal. Only to be used through TI provided API.
// MINUS_6                  Internal. Only to be used through TI provided API.
// MINUS_3                  Internal. Only to be used through TI provided API.
// MIN                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL2_ATTN_M                                   0x00000007
#define ADI_0_RF_IFAMPCTL2_ATTN_S                                            0
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_21                            0x00000007
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_18                            0x00000006
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_15                            0x00000005
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_12                            0x00000004
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_9                             0x00000003
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_6                             0x00000002
#define ADI_0_RF_IFAMPCTL2_ATTN_MINUS_3                             0x00000001
#define ADI_0_RF_IFAMPCTL2_ATTN_MIN                                 0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_PACTL0
//
//*****************************************************************************
// Field:   [7:3] TRIM
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL0_TRIM_M                                      0x000000F8
#define ADI_0_RF_PACTL0_TRIM_S                                               3

// Field:     [2] PEAKDET_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL0_PEAKDET_EN                                  0x00000004
#define ADI_0_RF_PACTL0_PEAKDET_EN_BITN                                      2
#define ADI_0_RF_PACTL0_PEAKDET_EN_M                                0x00000004
#define ADI_0_RF_PACTL0_PEAKDET_EN_S                                         2
#define ADI_0_RF_PACTL0_PEAKDET_EN_EN                               0x00000004
#define ADI_0_RF_PACTL0_PEAKDET_EN_DIS                              0x00000000

// Field:     [1] BIAS_DIS
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL0_BIAS_DIS                                    0x00000002
#define ADI_0_RF_PACTL0_BIAS_DIS_BITN                                        1
#define ADI_0_RF_PACTL0_BIAS_DIS_M                                  0x00000002
#define ADI_0_RF_PACTL0_BIAS_DIS_S                                           1

// Field:     [0] EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL0_EN                                          0x00000001
#define ADI_0_RF_PACTL0_EN_BITN                                              0
#define ADI_0_RF_PACTL0_EN_M                                        0x00000001
#define ADI_0_RF_PACTL0_EN_S                                                 0
#define ADI_0_RF_PACTL0_EN_EN                                       0x00000001
#define ADI_0_RF_PACTL0_EN_DIS                                      0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_PACTL1
//
//*****************************************************************************
// Field:   [7:6] GAIN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL1_GAIN_M                                      0x000000C0
#define ADI_0_RF_PACTL1_GAIN_S                                               6

// Field:   [5:0] IB
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL1_IB_M                                        0x0000003F
#define ADI_0_RF_PACTL1_IB_S                                                 0

//*****************************************************************************
//
// Register: ADI_0_RF_O_PACTL2
//
//*****************************************************************************
// Field:   [7:5] RXTX
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL2_RXTX_M                                      0x000000E0
#define ADI_0_RF_PACTL2_RXTX_S                                               5

// Field:   [4:3] CM
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL2_CM_M                                        0x00000018
#define ADI_0_RF_PACTL2_CM_S                                                 3

// Field:   [2:0] AD
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL2_AD_M                                        0x00000007
#define ADI_0_RF_PACTL2_AD_S                                                 0

//*****************************************************************************
//
// Register: ADI_0_RF_O_RFLDO0
//
//*****************************************************************************
// Field:     [5] ATEST_I_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO0_ATEST_I_EN                                  0x00000020
#define ADI_0_RF_RFLDO0_ATEST_I_EN_BITN                                      5
#define ADI_0_RF_RFLDO0_ATEST_I_EN_M                                0x00000020
#define ADI_0_RF_RFLDO0_ATEST_I_EN_S                                         5

